Revit 2027 API
FabricationPart.SplitStraight(XYZ) Method
 Splits the straight into two at the passed in point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SplitStraight(
	XYZ position
)
Public Function SplitStraight (
	position As XYZ
) As ElementId
public:
ElementId^ SplitStraight(
	XYZ^ position
)
member SplitStraight :
        position : XYZ -> ElementId
Parameters
position XYZ
 The position to split in the straight.
Return Value
ElementId
 Returns the element identifier of the new straight.
Exceptions
Exception | Condition
ArgumentException |  The position is not on the straight.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The part is not a straight.
See Also
Reference
FabricationPart Class
SplitStraight Overload
Autodesk.Revit.DB Namespace